SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

DROP DATABASE IF EXISTS `db_chengji`;
CREATE DATABASE `db_chengji` DEFAULT CHARACTER SET gbk COLLATE gbk_chinese_ci;
USE `db_chengji`;

CREATE TABLE IF NOT EXISTS `tb_kaosheng` (
  `id` bigint(4) NOT NULL AUTO_INCREMENT,
  `kaohao` varchar(10) NOT NULL,
  `xingming` varchar(12) NOT NULL,
  `xingbie` varchar(10) NOT NULL DEFAULT '',
  `timu` varchar(1000) NOT NULL,
  `daan` varchar(1000) NOT NULL,
  `jiaojuanshijian` datetime NOT NULL,
  `mima` varchar(10) NOT NULL,
  `fenshu` float NOT NULL,
  `zhaopian` varchar(20) NOT NULL DEFAULT 'none.jpg',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=32 ;

INSERT INTO `tb_kaosheng` (`id`, `kaohao`, `xingming`, `xingbie`, `timu`, `daan`, `jiaojuanshijian`, `mima`, `fenshu`, `zhaopian`) VALUES
(1, '001', '刘备', '', 'a:10:{i:0;i:5;i:1;i:14;i:2;i:17;i:3;i:23;i:4;i:26;i:5;i:33;i:6;i:35;i:7;i:36;i:8;i:51;i:9;i:59;}', '', '0000-00-00 00:00:00', '123456', 0, '1.jpg'),
(2, '002', '关羽', '', 'a:10:{i:0;i:3;i:1;i:6;i:2;i:10;i:3;i:22;i:4;i:28;i:5;i:31;i:6;i:34;i:7;i:49;i:8;i:55;i:9;i:63;}', '', '0000-00-00 00:00:00', '123456', 0, 'none.jpg'),
(3, '003', '张飞', '', '', '', '0000-00-00 00:00:00', '123456', 0, 'none.jpg'),
(4, '004', '赵云', '', '', '', '0000-00-00 00:00:00', '123456', 0, 'none.jpg'),
(5, '005', '马超', '', '\n', '', '0000-00-00 00:00:00', '123456', 0, 'none.jpg'),
(6, '006', '黄忠', '', '', '', '0000-00-00 00:00:00', 'rkqk1440', 0, 'none.jpg');

CREATE TABLE IF NOT EXISTS `tb_shiti` (
  `id` bigint(4) NOT NULL AUTO_INCREMENT,
  `timu` varchar(500) NOT NULL,
  `biaoda` varchar(5) NOT NULL,
  `fenzhi` int(2) NOT NULL,
  `A` varchar(500) NOT NULL,
  `B` varchar(500) NOT NULL,
  `C` varchar(500) NOT NULL,
  `D` varchar(500) NOT NULL,
  `E` varchar(500) NOT NULL,
  `mp3` varchar(500) NOT NULL,
  `mp4` varchar(500) NOT NULL,
  `jpg` varchar(500) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=69 ;

INSERT INTO `tb_shiti` (`id`, `timu`, `biaoda`, `fenzhi`, `A`, `B`, `C`, `D`, `E`, `mp3`, `mp4`, `jpg`) VALUES
(1, '千湖之省是哪个省？', 'B', 1, '湖南省', '湖北省', '浙江省', '江西省', '安徽省', '', '', ''),
(2, '看图回答问题。百湖之市是哪个城市？', 'B', 1, '长沙市', '武汉市', '南昌市', '杭州市', '', '', '', '1499222747.jpg'),
(3, '看图回答问题。武汉的市花是什么？', 'D', 1, '樱花', '玫瑰', '菊花', '梅花', '', '', '', '1499222763.jpg'),
(4, '看视频回答问题。湖广总督（）在汉阳修兵工厂。', 'B', 1, '奕?', '张之洞', '李鸿章', '张居正', '', '', '1499222788.mp4', ''),
(5, '听音乐回答问题。中部唯一特大城市，号称东方芝加哥的城市是哪个？', 'C', 1, '宜昌', '长沙', '武汉', '襄阳', '', '1499222811.mp3', '', ''),
(6, '看视频回答问题。中国最大的城中湖是哪个湖泊？', 'A', 1, '东湖', '汤逊湖', '南湖', '北湖', '', '', '', ''),
(7, '中国面积最大的省份是哪里？', 'C', 1, '西藏', '内蒙古自治区', '新疆维吾尔自治区', '黑龙江省', '', '', '', ''),
(8, '中国人口最的城市是哪里？', 'B', 1, '上海', '重庆', '北京', '广州', '', '', '', ''),
(9, '2008年奥运会在哪里举行？', 'C', 1, '纽约', '东京', '北京', '伦敦', '', '', '', ''),
(10, '2022年冬季奥运会在哪里举行？', 'D', 1, '武汉', '上海', '南京', '北京', '', '', '', ''),
(11, 'G20峰会在哪里举行？', 'B', 1, '上海', '杭州', '宁波', '南京', '', '', '', ''),
(12, '哪个国家是世界上人口最多的国家？', 'A', 1, '中国', '印度', '美国', '孟加拉国', '', '', '', ''),
(13, '哪个国家是四大文明古国之一？', 'D', 1, '美国', '英国', '德国', '中国', '', '', '', ''),
(14, '第一次鸦片战争发生在哪一年？', 'B', 1, '1842', '1840', '1919', '1863', '', '', '', ''),
(15, '上合组织总部在哪里？', 'A', 1, '上海', '北京', '西安', '南京', '', '', '', ''),
(16, '下面哪个国家是金砖国家？', 'B', 1, '日本', '中国', '德国', '瑞典', '', '', '', ''),
(17, '计算机具有记忆功能的部件是？', 'B', 1, '中央处理器', '存储器', '运算器', '总线', '', '', '', ''),
(18, '提出存储原理的科学家是哪一个？', 'B', 1, '爱因斯坦', '冯诺依曼', '爱迪生', '牛顿', '', '', '', ''),
(19, '在计算机中使用哪种数制？', 'B', 1, '十进制', '二进制', '八进制', '十六进制', '', '', '', ''),
(20, '联合国常任理事国有哪些？', 'ABCDE', 1, '中国', '美国', '英国', '俄罗斯', '法国', '', '', ''),
(21, '迄今为止发现的世界上最大的青铜器是司母戊大方鼎，它重（ ）。', 'C', 1, '675公斤', '775公斤', '875公斤', '975公斤', '', '', '', ''),
(22, '三国演义的作者是？', 'A', 1, '罗贯中', '施耐庵', '吴承恩', '吴敬梓', '', '', '', ''),
(23, '红楼梦作者是？', 'D', 1, '吴承恩', '罗贯中', '曹雪芹', '老舍', '', '', '', ''),
(24, '四大名著有哪些？', 'ACDE', 1, '水浒传', '儒林外史', '西游记', '红楼梦', '三国演义', '', '', ''),
(25, '我国的端午节是为了纪念楚国诗人？', 'A', 1, '屈原', '张居正', '李白', '杜甫', '', '', '', ''),
(26, '第一个统一中国的是？', 'B', 1, '楚庄王', '秦始皇', '唐太宗', '唐高宗', '', '', '', ''),
(27, '七步诗的作者是？', 'B', 1, '曹丕', '曹植', '曹操', '曹冲', '', '', '', ''),
(28, '我国最早关于哈雷彗星的记录出于（ ）。', 'C', 1, '《诗经》', '《甘石星经》', '《春秋》', '《离骚》', '', '', '', ''),
(29, '鼓浪屿在哪个省？', 'D', 1, '湖南省', '江西省', '浙江省', '福建省', '', '', '', ''),
(30, '三国演义中蜀国的五虎大将有哪些？', 'ABCDE', 1, '关羽', '张飞', '张云', '马超', '黄忠', '', '', ''),
(31, '勿以恶小而为之勿以善小而不为是哪个说的？', 'D', 1, '刘邦', '刘秀', '刘彻', '刘备', '', '', '', ''),
(32, '孔子是哪里人？', 'D', 1, '山西', '安徽', '河北', '山东', '', '', '', ''),
(33, '世界上面积最大的国家是？', 'C', 1, '中国', '加拿大', '俄罗斯', '美国', '', '', '', ''),
(34, '静夜思的作者是？', 'D', 1, '杜甫', '李清照', '白居易', '李白', '', '', '', ''),
(35, '安得广厦千万间的作者是？', 'C', 1, '李白', '孟浩然', '杜甫', '李牧', '', '', '', ''),
(36, '登鹳雀楼的作者是？', 'C', 1, '孟浩然', '李白', '王之涣', '李牧', '', '', '', ''),
(37, '宿建德江的作者是？', 'A', 1, '孟浩然', '李白', '杜甫', '白居易', '', '', '', ''),
(38, '芙蓉楼送辛渐的作者是？', 'C', 1, '孟浩然', '李煜', '王昌龄', '王之涣', '', '', '', ''),
(39, '早发白帝城的作者是？', 'D', 1, '杜甫', '王之涣', '王维', '李白', '', '', '', ''),
(40, '历史上第一个到达印度取经的是（ ）。', 'A', 1, '法显', '玄奘', '鉴真', '郑和', '', '', '', ''),
(41, '城阙辅三秦的后一句是？', 'B', 1, '与君离别意', '风烟望五津', '儿女共沾巾', '海内存知己', '', '', '', ''),
(42, '劝君更尽一杯酒的后一句是？', 'D', 1, '我自横刀向天笑', '天下谁人不识君', '莫愁前途无知己', '西出阳关无故人', '', '', '', ''),
(43, '&ldquo;贞观之治&rdquo;是指（ ）在位期间。', 'B', 1, '唐太祖', '唐太宗', '唐高宗', '唐玄宗', '', '', '', ''),
(44, '&ldquo;开元盛世&rdquo;时在位的是（ ）。', 'D', 1, '唐太祖', '唐太宗', '唐高宗', '唐玄宗', '', '', '', ''),
(45, '被称为&ldquo;诗圣&rdquo;的是诗人（ ）。', 'C', 1, '李白', '白居易', '杜甫', '王维', '', '', '', ''),
(46, '隋代李春设计的赵州桥是世界上最古老的（ ）。', 'B', 1, '实肩式石拱桥', '敞肩式石拱桥', '联拱石桥', '石梁桥', '', '', '', ''),
(47, '我国最大的一部丛书是（ ）。', 'C', 1, '《资治通鉴》', '《永乐大典》', '《四库全书》', '《古今图书集成》', '', '', '', ''),
(48, '在部分东南亚佛教国家，通常盛行（ ）。', 'C', 1, '接吻礼', '鞠躬礼', '合掌礼', '握手礼', '', '', '', ''),
(49, '湖北省的简称是（ ）。', 'D', 1, '楚', '荆', '巴', '鄂', '', '', '', ''),
(50, '五岳归来不看山，（ ）归来不看岳。', 'A', 1, '黄山', '庐山', '华山', '崂山', '', '', '', ''),
(51, '外国游客如需购买麝香，导游人员应该（ ）。', 'D', 1, '&quot;&quot;&quot;提供必要帮助 &quot;&quot;&quot;', '建议其自行处理', '断然拒绝', '劝阻，并告知中国海关规定', '', '', '', ''),
(52, '宋代四大书院之一的白鹿洞书院，位于（ ）。', 'B', 1, '黄山', '庐山', '华山', '崂山', '', '', '', ''),
(53, '旅游安全管理工作应当贯彻（ ）的方针。', 'A', 1, '安全第一，预防为主', '预防第一，安全为主', '安全第一，安全为主', '安全第一，管理为主', '', '', '', ''),
(54, '有华中屋脊之称的我国中部最高峰是神农架的神农顶，海拔（ ）', 'C', 1, '3104.4米', '3104.5米', '3105.4米', '3105.5米', '', '', '', ''),
(55, '宋朝李纲的诗句&ldquo;溪边列岩岫，倒影浸寒绿&rdquo;描绘的是（ ）的美景。', 'D', 1, '丹霞山', '九华山', '雁荡山', '武夷山', '', '', '', ''),
(56, '我国海岸线全长18000公里，一般以钱塘江口为界，其北以泥沙质海岸为主，个别地区如（ ）等地为基岩海岸。', 'A', 1, '辽东半岛', '北戴河', '黄河口', '长江口', '', '', '', ''),
(57, '我国海岸线全长18000公里，一般以钱塘江口为界，其南以基岸海岸为主，只在（ ）等少数地区为泥沙质海岸。', 'D', 1, '辽东半岛', '山东半岛', '北戴河', '珠江口', '', '', '', ''),
(58, '&ldquo;峡中有峡，滩中有滩&rdquo;形容的是（ ）。', 'A', 1, '西陵峡', '巫峡', '瞿塘峡', '黄牛峡', '', '', '', ''),
(59, '&ldquo;牡丹故乡&rdquo;指的是（ ）。', 'C', 1, '河南洛阳', '山东菏泽', '湖北保康', '湖北房县', '', '', '', ''),
(60, '孔子等东山儿小鲁，登（）而小天下？', 'A', 1, '泰山', '黄山', '华山', '衡山', '', '', '', ''),
(61, '海上生明月的下一句是？', 'B', 1, '还来就菊花', '天涯共此时', '把酒话桑麻', '白日依山尽', '', '', '', ''),
(62, '曾经沧海难为水，除却巫山不是云的作者是？', 'C', 1, '李煜', '苏轼', '元稹', '苏洵', '', '', '', ''),
(63, '唐宋八大家有哪些？', 'ABDE', 1, '苏洵', '苏轼', '李白', '欧阳修', '王安石', '', '', ''),
(0, '愿得一心人，白头不相离的作者是？', 'B', 1, '曹操', '卓文君', '欧阳修', '王安石', '', '', '', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
